/*===================================================================
	■■■ 배열 ■■■
	-  다차원 배열(배열의 배열)
===================================================================*/
// ※ ○ ★ 『  』  →   ←  ↓  ↑ ⬛ ① ② ③ /* */ 

/* 
	
*/

import java.util.Scanner;
import java.io.IOException;

public class Test089
{
	public static void main(String[] args)
	{
		// 배열의 배열 선언과 초기화
		// 방법①
		//int[] arr1 = new int[3];
		int[][] arr1 = new int[3][3];
		
		//arr1[0] = 1;
		arr1[0][0] = 1;
		arr1[0][1] = 2;
		arr1[0][2] = 3;
		
		arr1[1][0] = 4;
		arr1[1][1] = 5;
		arr1[1][2] = 6;
		
		arr1[2][0] = 7;
		arr1[2][1] = 8;
		arr1[2][2] = 9;
	}
}