/*===================================================================
	■■■ 배열 ■■■
	-  다차원 배열(배열의 배열)
===================================================================*/
// ※ ○ ★ 『  』 ⬛ ▣ ① ② ③ ④   →   ←  ↓  …  ： ↑ /* */ 

/* 
	
*/

/* 
	다차원 배열(배열의 배열)을 활용하여,
	다음과 같은 데이터를 요소로 취하는 배열(5x5)를 구성하고
	그 결과를 출력하는 프로그램을 구현한다.
	
	
	실행 예)
	 1  2  3  4  5
	 5  1  2  3  4
	 4  5  1  2  3
	 3  4  5  1  2
	 2  3  4  5  1
	 
	계속하려면 아무 키나 누르세요....
*/

/*
	 1  2  3  4  5  |  1  2  3  4  5 |
	 5  1  2  3  4  |     1  2  3  4 | 5
	 4  5  1  2  3  |        1  2  3 | 4  5
	 3  4  5  1  2  |           1  2 | 3  4  5
	 2  3  4  5  1  |              1 | 2  3  4  5
	 
	                |              j : 5  → 0 
					| 00 01 02 03 04 |                → i:0
					|    11 12 13 14 | 10             → i:1
					|       22 23 24 | 20 21          → i:2
					|          33 34 | 30 31 32       → i:3
					|             44 | 40 41 42 43    → i:4

*/

public class Test092
{
	public static void main(String[] args)
	{
		// 다차원 배열 초기화 테스트
		/*
		int[][] arrList = { 
			{11, 12, 13, 14, 15}, // 1행
			{21, 22, 23, 24, 25}, // 2행
			{31, 32, 33, 34, 35}, // 3행
		};
		
		for (int i = 0; i < arrList.length; i++)
		{
			for (int j = 0; j < arrList[i].length; j++)
			{
				System.out.print(arrList[i][j] + " ");
			}
			
			System.out.println();
		}
		
		*/
		/*
		
		//변수 선언 및 초기화
		int nRow, nCol, nTemp;
		int[][] arr;
		
		nTemp = 1;
		nRow = nCol = 5;
		arr = new int[nRow][nCol];
		
		
		// 다차원 배열 요소 초기화
		for (int i = 0; i < arr.length; i++)
		{
			for (int j = 0; j < arr[i].length; j++)
			{
				arr[i][j] = nTemp;
				nTemp++;
				nTemp = (nTemp > nRow) ? 1 : nTemp;
			}
			
			nTemp = arr[i][nCol-1];
		}
		
		// 다차원 배열 전체 요소 출력
		for (int i = 0; i < arr.length; i++)
		{
			for (int j = 0; j < arr[i].length; j++)
			{
				System.out.printf("%2d ", arr[i][j]);
			}
				System.out.println();	// 개행
		}
		//-- 실행결과
		// 1  2  3  4  5
		// 5  1  2  3  4
		// 4  5  1  2  3
		// 3  4  5  1  2
		// 2  3  4  5  1
		//계속하려면 아무 키나 누르십시오 . . .
		//	
		
		*/
		
		//배열의 배열 선언 및 메모리 할당
		int[][] arr = new int[5][5];
		
		for (int i = 0; i < arr.length; i++)            //-- 웅~~~   i → 0     1     2     3     4
		{
			for (int n = 1, j=i; n <= 5; n++)           //-- 쑝쑝쑝  n → 12345 12345 12345 12345 12345
			{
				arr[i][j] = n;
				//확인(테스트)
				//System.out.print("(i:" + i + ", j:" + j + ") →  n:" + n + " ");
				//--실행결과
				//(i:0, j:0) →  n:1 (i:0, j:1) →  n:2 (i:0, j:2) →  n:3 (i:0, j:3) →  n:4 (i:0, j:4) →  n:5
				//(i:1, j:1) →  n:1 (i:1, j:2) →  n:2 (i:1, j:3) →  n:3 (i:1, j:4) →  n:4 (i:1, j:0) →  n:5
				//(i:2, j:2) →  n:1 (i:2, j:3) →  n:2 (i:2, j:4) →  n:3 (i:2, j:0) →  n:4 (i:2, j:1) →  n:5
				//(i:3, j:3) →  n:1 (i:3, j:4) →  n:2 (i:3, j:0) →  n:3 (i:3, j:1) →  n:4 (i:3, j:2) →  n:5
				//(i:4, j:4) →  n:1 (i:4, j:0) →  n:2 (i:4, j:1) →  n:3 (i:4, j:2) →  n:4 (i:4, j:3) →  n:5
				//계속하려면 아무 키나 누르십시오 . . .				
				
				j++;
				
				if (j == 5)
				{
					j = 0;
				}
				
				/*
				
				arr[0][0] = 1; arr[0][1] = 2; arr[0][2] = 3;  arr[0][3] = 4;  arr[0][4] = 5;
				arr[1][1] = 1; arr[1][2] = 2; arr[1][3] = 3;  arr[1][4] = 4;  arr[1][0] = 5;
				arr[2][2] = 1; arr[2][3] = 2; arr[2][4] = 3;  arr[2][0] = 4;  arr[2][1] = 5;
				arr[3][3] = 1; arr[3][4] = 2; arr[3][0] = 3;  arr[3][1] = 4;  arr[3][2] = 5;
				arr[4][4] = 1; arr[4][0] = 2; arr[4][1] = 3;  arr[4][2] = 4;  arr[4][3] = 5;
				                                   ↓      
				
				arr[0][0] = 1; arr[0][1] = 2; arr[0][2] = 3;  arr[0][3] = 4;  arr[0][4] = 5;
				arr[1][0] = 5; arr[1][1] = 1; arr[1][2] = 2;  arr[1][3] = 3;  arr[1][4] = 4;
				arr[2][0] = 4; arr[2][1] = 5; arr[2][2] = 1;  arr[2][3] = 2;  arr[2][4] = 3;
				arr[3][0] = 3; arr[3][1] = 4; arr[3][2] = 5;  arr[3][3] = 1;  arr[3][4] = 2;
				arr[4][0] = 2; arr[4][1] = 3; arr[4][2] = 4;  arr[4][3] = 5;  arr[4][4] = 1;
				
				
				n → 12345 12345 12345 12345 12345
				
				
				1   2   3    4    5 → 웅  i →  0
				    1   2    3    4    5 → 웅  i →  1
				        1    2    3    4    5 → 웅  i →  2
				             1    2    3    4    5 → 웅  i →  3
				                  1    2    3    4    5 → 웅  i →  4
				
				00  01  02  03   04
				10  11  12  13   14
				
				*/
				
			}
			
			//System.out.println();
		}
		
		//배열의 배열 전체 요소 출력
		for (int i = 0; i < arr.length; i++)
		{
			for (int j = 0; j < arr[i].length; j++)
			{
				System.out.printf("%3d", arr[i][j]);
			}
			
			System.out.println();
		}
	}
}

//-- 실행결과
//  1  2  3  4  5
//  5  1  2  3  4
//  4  5  1  2  3
//  3  4  5  1  2
//  2  3  4  5  1
//계속하려면 아무 키나 누르십시오 . . .