/*===================================================================
	■■■ 실행 흐름의 컨트롤(제어문) ■■■
		- 5장. 실행흐름의 컨트롤
		- if문
		- if ~ else문 실습
===================================================================*/


//특정 문장을 수행하고자 할 때 사용하는 구문이다.


//사용자로부터 임의의 정수를 입력받아
//다음과 같은 판별 결과를 출력하는 프로그램을 구현한다.

//2의 배수 / 3의 배수 / 2와 3의 배수 / 2와 3의 배수 아님

//실행 예)
//임의의 정수 입력 : 4
//>> 4 → 2의 배수
//계속하려면 아무 키나 누르세요....


//임의의 정수 입력 : 9
//>> 9 → 3의 배수
//계속하려면 아무 키나 누르세요....


//임의의 정수 입력 : 12
//>> 12 → 2와 3의 배수
//계속하려면 아무 키나 누르세요....


//임의의 정수 입력 : 17
//>> 17 → 2와 3의 배수 아님

//계속하려면 아무 키나 누르세요....


public class Test033
{
	public static void main(String[] args)
	{
		
	}
}