/*===================================
 ⬛⬛⬛  ⬛⬛⬛
====================================*/

// 단일행 주석문(comment)  라인 단위 주석문

/*
다중행
주석문
처리 
→ 블럭 단위 주석문
*/

// - 클래스의 이름은 『Test001』
// - 자바 프로그램의 클래스 이름은 첫 글자를 『대문자』로 시작.
// - 당분간 .. 실습을 진행하는 동안...
//		자바 프로그램 시작할 때 클래스와 main() 메서드를
//		기본적으로 작성할 수 있도록 한다.
// - 소스 코드 저장 시 클래스의 이름과 동일한 파일 이름으로 저장.
//		단, 이 때 확장자는 『.java』

public class Test001
{
	// main() 이라는 이름을 가진 메서드(메서드는 곧 함수)
	public static void main(String[] args)
	{
		System.out.println("Test");
		System.out.println("김남일");
	}
}