/*===================================================================
	■■■ 배열 ■■■
	-  다차원 배열(배열의 배열)
===================================================================*/
// ※ ○ ★ 『  』 ⬛ ▣ ① ② ③ ④   →  ←  ↓  …  ： ↑ /* */ 

/* 
	
*/

/* 
	다차원 배열(배열의 배열)을 활용하여,
	다음과 같은 데이터를 요소로 취하는 배열을 구성하고
	그 결과를 출력하는 프로그램을 구현한다.
	
	
	실행 예)
	 1  8   9  16  17
	 2  7  10  15  18
	 3  6  11  14  19
	 4  5  12  13  20
	계속하려면 아무 키나 누르세요....
	
	00 - 1   
	10 - 2
	20 - 3
	30 - 4
	
	31 - 5
	21 - 6
	11 - 7
	01 - 8
	
	03 - 9
	13 - 10
	23 - 11
	33 - 12
	
	34 - 13
	24 - 14
	14 - 15
	04 - 16
	
	05 - 17
	15 - 18
	25 - 19
	35 - 20
*/

/*

          |     i 짝수    |               |    i 짝수    |               |    i 짝수
0 1 2 3 4 |   0  0  0  0  |   1  1  1  1  |  2  2  2  2  |   3  3  3  3  |  4  4  4  4
웅~~~~    |   i  i  i  i  |   i  i  i  i  |  i  i  i  i  |   i  i  i  i  |  i  i  i  i
          |  00 10 20 30  |  31 21 11 01  | 02 12 22 32  |  33 23 13 03  | 04 14 24 34
쑝쑝쑝쑝  |   j  j  j  j  |   j  j  j  j  |  j  j  j  j  |   j  j  j  j  |  j  j  j  j
0123      |   0  1  2  3  |   3  2  1  0  |  0  1  2  3  |   3  2  1  0  |  0  1  2  3
방샹성    |   --------→  |   ←--------  |  --------→  |   ←--------  |  --------→

*/

public class Test093
{
	public static void main(String[] args)
	{
		/*
		// 변수 선언 및 초기화
		int nTemp = 1, nRow, nCol, jj;
		int[][] arr;
		
		nRow = 4;
		nCol = 5;
		arr = new int[nRow][nCol];
		
		//
		for (int i = 0; i < 5; i++)
		{
			
			//
			for (int j = 0, n = 3; j < 4; j++, n--)
			{
				
				if ((nTemp >= 5 && nTemp <= 8) || (nTemp >= 13 && nTemp <= 16))
				{
					jj	= n;
				} else {
					jj = j;
				}
				//System.out.printf("%2d  ", nTemp);
				
				arr[jj][i] = nTemp;
				nTemp++;
			}
			
			
		}
		
		System.out.println();
		//--실행결과
		// 1   5   9  13   0
		// 2   6  10  14   0
		// 3   7  11  15   0
		// 4   8  12  16   0
		//계속하려면 아무 키나 누르십시오 . . .

		
		//
		for (int i = 0; i < arr.length; i++)
		{
			for (int j = 0; j < arr[i].length; j++)
			{
				System.out.printf("%2d  ", arr[i][j]);
			}
			
			System.out.println();
		}
		
		*/
		
		// 배열의 배열 선언 및 메모리 할당
		int[][] arr = new int[4][5];
		
		int n = 0;                       // 1 ~ 20
		
		for (int i = 0; i < 5; i++)      //  outer 웅~~~   i  →  0    1    2    3    4
		{
			for (int j = 0; j < 4; j++)  //  inner 쑝쑝쑝  j  →  0123 0123 0123 0123 0123 
			{
				n++;
				
				//확인(테스트)
				//System.out.println("n : " + n);
				
				//arr[j][i] = n;
				
				if (i%2 == 0)        // i가 짝수일 경우  → 0
				{
					arr[j][i] = n;   // j를 0123         → 00 10 20 30
				} else {             // i가 홀수일 경우  → 1
					//arr[?][i] = n;
					arr[3-j][i] = n; // j를 3210         → 31 21 11 01
				}
			}
		}
		
		
		//배열의 배열 요소 전체 출력
		for (int i = 0; i < arr.length; i++)
		{
			for (int j = 0; j < arr[i].length; j++)
			{
				System.out.printf("%3d", arr[i][j]);
			}
			
			System.out.println(); // 개행
		}
		
	}
}

//--실행결과
//  1  8  9 16 17
//  2  7 10 15 18
//  3  6 11 14 19
//  4  5 12 13 20
//계속하려면 아무 키나 누르십시오 . . .
