--▣ 현재 날짜 및 시간을 기준으로...
--   본인이 태어나서 현재까지...
--   얼마만큼의 일, 시간, 분, 초를 살고있는지
--   다음과 같은 형태로 조회할 수 있도록 쿼리문을 구성한다.
/*
-----------------------------------------------------------------------------
현재시각                |  태어난시각             | 일    | 시간    | 분   | 초
-----------------------------------------------------------------------------
2025-07-01 14:31:27 | 1999-11-05 12:00:00 | XXXX | XX      | XX  | XX
-----------------------------------------------------------------------------
*/

SELECT SYSDATE "현재시각"
     , TO_DATE('1976-06-01 12:00:00', 'YYYY-MM-DD HH24:MI:SS') "태어난시각"
     , TRUNC(SYSDATE - TO_DATE('1976-06-01 12:00:00', 'YYYY-MM-DD HH24:MI:SS')) "일"
     , TRUNC(MOD(SYSDATE - TO_DATE('1976-06-01 12:00:00', 'YYYY-MM-DD HH24:MI:SS'), 1) * 24) "시간"
     , TRUNC(MOD(MOD(SYSDATE - TO_DATE('1976-06-01 12:00:00', 'YYYY-MM-DD HH24:MI:SS'), 1) * 24, 1) * 60) "분"
     , TRUNC(MOD(MOD(MOD(SYSDATE - TO_DATE('1976-06-01 12:00:00', 'YYYY-MM-DD HH24:MI:SS'), 1) * 24, 1) * 60, 1) * 60) "초"
FROM DUAL;

/*
현재시각                      태어난시각                 일          시간     분       초
-----------------------     ---------------------    ----------   -------  ----- -------
2025-07-01 16:14:10       1976-06-01 12:00:00    17927        4       14      9
*/